sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_uart.c
    if (huart->gState == HAL_UART_STATE_RESET)
    {
        /* Allocate lock resource and initialize it */
        huart->Lock = HAL_UNLOCKED;

#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
        UART_InitCallbacksToDefault(huart);

        if (huart->MspInitCallback == NULL)
        {
            huart->MspInitCallback = HAL_UART_MspInit;
        }

        /* Init the low level hardware */
        huart->MspInitCallback(huart);
#else
        /* Init the low level hardware : GPIO, CLOCK */
        HAL_UART_MspInit(huart);
#endif /* (USE_HAL_UART_REGISTER_CALLBACKS) */
    }

    huart->gState = HAL_UART_STATE_BUSY;

    /* Disable the peripheral */
    __HAL_UART_DISABLE(huart);

    /* Set the UART Communication parameters */
    UART_SetConfig(huart);

    if (huart->AdvancedInit.AdvFeatureInit != UART_ADVFEATURE_NO_INIT)
    {
        UART_AdvFeatureConfig(huart);
    }
    /* In asynchronous mode, the following bits must be kept cleared:
       - LINEN and CLKEN bits in the USART_CR2 register,
       - SCEN, HDSEL and IREN  bits in the USART_CR3 register.*/
    CLEAR_BIT(huart->Instance->CR2, USART_CR2_CLKEN);
    CLEAR_BIT(huart->Instance->CR3, USART_CR3_HDSEL);

    /* Enable the peripheral */
    __HAL_UART_ENABLE(huart);

    /* Initialize the UART state */
    huart->ErrorCode = HAL_UART_ERROR_NONE;
    huart->gState = HAL_UART_STATE_READY;
    huart->RxState = HAL_UART_STATE_READY;

    return HAL_OK;
}

/**
  * @brief  Initializes the half-duplex mode according to the specified
  *         parameters in the UART_InitTypeDef and create the associated handle.
  * @param  huart  Pointer to a UART_HandleTypeDef structure that contains
  *                the configuration information for the specified UART module.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_HalfDuplex_Init(UART_HandleTypeDef *huart)
{
    /* Check the UART handle allocation */
    if (huart == NULL)
    {
        return HAL_ERROR;
    }

    /* Check the parameters */
    assert_param(IS_UART_HALFDUPLEX_INSTANCE(huart->Instance));
    assert_param(IS_UART_WORD_LENGTH(huart->Init.WordLength));
#if defined(USART_CR3_OVER8)
    assert_param(IS_UART_OVERSAMPLING(huart->Init.OverSampling));
#endif /* USART_CR3_OVER8 */

    if (huart->gState == HAL_UART_STATE_RESET)
    {
        /* Allocate lock resource and initialize it */
        huart->Lock = HAL_UNLOCKED;

#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
        UART_InitCallbacksToDefault(huart);

        if (huart->MspInitCallback == NULL)
        {
            huart->MspInitCallback = HAL_UART_MspInit;
        }

        /* Init the low level hardware */
        huart->MspInitCallback(huart);
#else
        /* Init the low level hardware : GPIO, CLOCK */
        HAL_UART_MspInit(huart);
#endif /* (USE_HAL_UART_REGISTER_CALLBACKS) */
    }

    huart->gState = HAL_UART_STATE_BUSY;

    /* Disable the peripheral */
    __HAL_UART_DISABLE(huart);

    /* Set the UART Communication parameters */
    UART_SetConfig(huart);

    /* In half-duplex mode, the following bits must be kept cleared:
       - LINEN and CLKEN bits in the USART_CR2 register,
       - SCEN and IREN bits in the USART_CR3 register.*/
    CLEAR_BIT(huart->Instance->CR2, USART_CR2_CLKEN);
    //CLEAR_BIT(huart->Instance->CR3, (USART_CR3_IREN | USART_CR3_SCEN));

    /* Enable the Half-Duplex mode by setting the HDSEL bit in the CR3 register */
    SET_BIT(huart->Instance->CR3, USART_CR3_HDSEL);

    /* Enable the peripheral */
    __HAL_UART_ENABLE(huart);

    /* Initialize the UART state*/
    huart->ErrorCode = HAL_UART_ERROR_NONE;
    huart->gState = HAL_UART_STATE_READY;
    huart->RxState = HAL_UART_STATE_READY;

    return HAL_OK;
}

///**
//  * @brief  Initializes the LIN mode according to the specified
//  *         parameters in the UART_InitTypeDef and create the associated handle.
//  * @param  huart  Pointer to a UART_HandleTypeDef structure that contains
//  *                the configuration information for the specified UART module.
//  * @param  BreakDetectLength Specifies the LIN break detection length.
//  *         This parameter can be one of the following values:
//  *            @arg UART_LINBREAKDETECTLENGTH_10B: 10-bit break detection
//  *            @arg UART_LINBREAKDETECTLENGTH_11B: 11-bit break detection
//  * @retval HAL status
//  */
//HAL_StatusTypeDef HAL_LIN_Init(UART_HandleTypeDef *huart, uint32_t BreakDetectLength)
//{
//  /* Check the UART handle allocation */
//  if (huart == NULL)
//  {
//    return HAL_ERROR;
//  }

//  /* Check the LIN UART instance */
//  assert_param(IS_UART_LIN_INSTANCE(huart->Instance));

//  /* Check the Break detection length parameter */
//  assert_param(IS_UART_LIN_BREAK_DETECT_LENGTH(BreakDetectLength));
//  assert_param(IS_UART_LIN_WORD_LENGTH(huart->Init.WordLength));
//#if defined(USART_CR3_OVER8)
//  assert_param(IS_UART_LIN_OVERSAMPLING(huart->Init.OverSampling));
//#endif /* USART_CR3_OVER8 */

//  if (huart->gState == HAL_UART_STATE_RESET)
//  {
//    /* Allocate lock resource and initialize it */
//    huart->Lock = HAL_UNLOCKED;

//#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
//    UART_InitCallbacksToDefault(huart);

//    if (huart->MspInitCallback == NULL)
//    {
//      huart->MspInitCallback = HAL_UART_MspInit;
//    }

//    /* Init the low level hardware */
//    huart->MspInitCallback(huart);
//#else
//    /* Init the low level hardware : GPIO, CLOCK */
//    HAL_UART_MspInit(huart);
//#endif /* (USE_HAL_UART_REGISTER_CALLBACKS) */
//  }

//  huart->gState = HAL_UART_STATE_BUSY;

//  /* Disable the peripheral */
//  __HAL_UART_DISABLE(huart);

//  /* Set the UART Communication parameters */
//  UART_SetConfig(huart);

//  /* In LIN mode, the following bits must be kept cleared:
//     - CLKEN bits in the USART_CR2 register,
//     - SCEN, HDSEL and IREN bits in the USART_CR3 register.*/
//  CLEAR_BIT(huart->Instance->CR2, (USART_CR2_CLKEN));
//  CLEAR_BIT(huart->Instance->CR3, (USART_CR3_HDSEL | USART_CR3_IREN | USART_CR3_SCEN));

//  /* Enable the LIN mode by setting the LINEN bit in the CR2 register */
//  SET_BIT(huart->Instance->CR2, USART_CR2_LINEN);

