sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_uart.c
        case HAL_UART_RX_HALFCOMPLETE_CB_ID :
            huart->RxHalfCpltCallback = pCallback;
            break;

        case HAL_UART_RX_COMPLETE_CB_ID :
            huart->RxCpltCallback = pCallback;
            break;

        case HAL_UART_ERROR_CB_ID :
            huart->ErrorCallback = pCallback;
            break;

        case HAL_UART_ABORT_COMPLETE_CB_ID :
            huart->AbortCpltCallback = pCallback;
            break;

        case HAL_UART_ABORT_TRANSMIT_COMPLETE_CB_ID :
            huart->AbortTransmitCpltCallback = pCallback;
            break;

        case HAL_UART_ABORT_RECEIVE_COMPLETE_CB_ID :
            huart->AbortReceiveCpltCallback = pCallback;
            break;

        case HAL_UART_MSPINIT_CB_ID :
            huart->MspInitCallback = pCallback;
            break;

        case HAL_UART_MSPDEINIT_CB_ID :
            huart->MspDeInitCallback = pCallback;
            break;

        default :
            /* Update the error code */
            huart->ErrorCode |= HAL_UART_ERROR_INVALID_CALLBACK;

            /* Return error status */
            status =  HAL_ERROR;
            break;
        }
    }
    else if (huart->gState == HAL_UART_STATE_RESET)
    {
        switch (CallbackID)
        {
        case HAL_UART_MSPINIT_CB_ID :
            huart->MspInitCallback = pCallback;
            break;

        case HAL_UART_MSPDEINIT_CB_ID :
            huart->MspDeInitCallback = pCallback;
            break;

        default :
            /* Update the error code */
            huart->ErrorCode |= HAL_UART_ERROR_INVALID_CALLBACK;

            /* Return error status */
            status =  HAL_ERROR;
            break;
        }
    }
    else
    {
        /* Update the error code */
        huart->ErrorCode |= HAL_UART_ERROR_INVALID_CALLBACK;

        /* Return error status */
        status =  HAL_ERROR;
    }

    /* Release Lock */
    __HAL_UNLOCK(huart);

    return status;
}

/**
  * @brief  Unregister an UART Callback
  *         UART callaback is redirected to the weak predefined callback
  * @param  huart uart handle
  * @param  CallbackID ID of the callback to be unregistered
  *         This parameter can be one of the following values:
  *           @arg @ref HAL_UART_TX_HALFCOMPLETE_CB_ID Tx Half Complete Callback ID
  *           @arg @ref HAL_UART_TX_COMPLETE_CB_ID Tx Complete Callback ID
  *           @arg @ref HAL_UART_RX_HALFCOMPLETE_CB_ID Rx Half Complete Callback ID
  *           @arg @ref HAL_UART_RX_COMPLETE_CB_ID Rx Complete Callback ID
  *           @arg @ref HAL_UART_ERROR_CB_ID Error Callback ID
  *           @arg @ref HAL_UART_ABORT_COMPLETE_CB_ID Abort Complete Callback ID
  *           @arg @ref HAL_UART_ABORT_TRANSMIT_COMPLETE_CB_ID Abort Transmit Complete Callback ID
  *           @arg @ref HAL_UART_ABORT_RECEIVE_COMPLETE_CB_ID Abort Receive Complete Callback ID
  *           @arg @ref HAL_UART_MSPINIT_CB_ID MspInit Callback ID
  *           @arg @ref HAL_UART_MSPDEINIT_CB_ID MspDeInit Callback ID
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_UART_UnRegisterCallback(UART_HandleTypeDef *huart, HAL_UART_CallbackIDTypeDef CallbackID)
{
    HAL_StatusTypeDef status = HAL_OK;

    /* Process locked */
    __HAL_LOCK(huart);

    if (HAL_UART_STATE_READY == huart->gState)
    {
        switch (CallbackID)
        {
        case HAL_UART_TX_HALFCOMPLETE_CB_ID :
            huart->TxHalfCpltCallback = HAL_UART_TxHalfCpltCallback;               /* Legacy weak  TxHalfCpltCallback       */
            break;

        case HAL_UART_TX_COMPLETE_CB_ID :
            huart->TxCpltCallback = HAL_UART_TxCpltCallback;                       /* Legacy weak TxCpltCallback            */
            break;

        case HAL_UART_RX_HALFCOMPLETE_CB_ID :
            huart->RxHalfCpltCallback = HAL_UART_RxHalfCpltCallback;               /* Legacy weak RxHalfCpltCallback        */
            break;

        case HAL_UART_RX_COMPLETE_CB_ID :
            huart->RxCpltCallback = HAL_UART_RxCpltCallback;                       /* Legacy weak RxCpltCallback            */
            break;

        case HAL_UART_ERROR_CB_ID :
            huart->ErrorCallback = HAL_UART_ErrorCallback;                         /* Legacy weak ErrorCallback             */
            break;

        case HAL_UART_ABORT_COMPLETE_CB_ID :
            huart->AbortCpltCallback = HAL_UART_AbortCpltCallback;                 /* Legacy weak AbortCpltCallback         */
            break;

        case HAL_UART_ABORT_TRANSMIT_COMPLETE_CB_ID :
            huart->AbortTransmitCpltCallback = HAL_UART_AbortTransmitCpltCallback; /* Legacy weak AbortTransmitCpltCallback */
            break;

        case HAL_UART_ABORT_RECEIVE_COMPLETE_CB_ID :
            huart->AbortReceiveCpltCallback = HAL_UART_AbortReceiveCpltCallback;   /* Legacy weak AbortReceiveCpltCallback  */
            break;

        case HAL_UART_MSPINIT_CB_ID :
            huart->MspInitCallback = HAL_UART_MspInit;                             /* Legacy weak MspInitCallback           */
            break;

        case HAL_UART_MSPDEINIT_CB_ID :
            huart->MspDeInitCallback = HAL_UART_MspDeInit;                         /* Legacy weak MspDeInitCallback         */
            break;

        default :
            /* Update the error code */
            huart->ErrorCode |= HAL_UART_ERROR_INVALID_CALLBACK;

            /* Return error status */
            status =  HAL_ERROR;
            break;
        }
    }
    else if (HAL_UART_STATE_RESET == huart->gState)
    {
        switch (CallbackID)
        {
        case HAL_UART_MSPINIT_CB_ID :
            huart->MspInitCallback = HAL_UART_MspInit;
            break;

        case HAL_UART_MSPDEINIT_CB_ID :
            huart->MspDeInitCallback = HAL_UART_MspDeInit;
            break;

        default :
            /* Update the error code */
            huart->ErrorCode |= HAL_UART_ERROR_INVALID_CALLBACK;

            /* Return error status */
            status =  HAL_ERROR;
            break;
        }
    }
    else
    {
        /* Update the error code */
        huart->ErrorCode |= HAL_UART_ERROR_INVALID_CALLBACK;

        /* Return error status */
        status =  HAL_ERROR;
    }

    /* Release Lock */
    __HAL_UNLOCK(huart);

