sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_uart.c
    /* Check that a Tx process is not already ongoing */
    if (huart->gState == HAL_UART_STATE_READY)
    {
        if ((pData == NULL) || (Size == 0U))
        {
            return HAL_ERROR;
        }

        /* Process Locked */
        __HAL_LOCK(huart);

        huart->pTxBuffPtr = pData;
        huart->TxXferSize = Size;
        huart->TxXferCount = Size;

        huart->ErrorCode = HAL_UART_ERROR_NONE;
        huart->gState = HAL_UART_STATE_BUSY_TX;

        /* Set the UART DMA transfer complete callback */
        huart->hdmatx->XferCpltCallback = UART_DMATransmitCplt;

        /* Set the UART DMA Half transfer complete callback */
        huart->hdmatx->XferHalfCpltCallback = UART_DMATxHalfCplt;

        /* Set the DMA error callback */
        huart->hdmatx->XferErrorCallback = UART_DMAError;

        /* Set the DMA abort callback */
        huart->hdmatx->XferAbortCallback = NULL;

        /* Enable the UART transmit DMA channel */
        tmp = (uint32_t *)&pData;
        HAL_DMA_Start_IT(huart->hdmatx, *(uint32_t *)tmp, (uint32_t)&huart->Instance->DR, Size);

        /* Clear the TC flag in the SR register by writing 0 to it */
        __HAL_UART_CLEAR_FLAG(huart, UART_FLAG_TC);

        /* Process Unlocked */
        __HAL_UNLOCK(huart);

        /* Enable the DMA transfer for transmit request by setting the DMAT bit
           in the UART CR3 register */
        SET_BIT(huart->Instance->CR3, USART_CR3_DMAT);

        return HAL_OK;
    }
    else
    {
        return HAL_BUSY;
    }
}

/**
  * @brief  Receives an amount of data in DMA mode.
  * @note   When UART parity is not enabled (PCE = 0), and Word Length is configured to 9 bits (M1-M0 = 01),
  *         the received data is handled as a set of u16. In this case, Size must indicate the number
  *         of u16 available through pData.
  * @param  huart Pointer to a UART_HandleTypeDef structure that contains
  *               the configuration information for the specified UART module.
  * @param  pData Pointer to data buffer (u8 or u16 data elements).
  * @param  Size  Amount of data elements (u8 or u16) to be received.
  * @note   When the UART parity is enabled (PCE = 1) the received data contains the parity bit.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_UART_Receive_DMA(UART_HandleTypeDef *huart, uint8_t *pData, uint16_t Size)
{
//  uint32_t *tmp;

    /* Check that a Rx process is not already ongoing */
    if (huart->RxState == HAL_UART_STATE_READY)
    {
        if ((pData == NULL) || (Size == 0U))
        {
            return HAL_ERROR;
        }
        /* In case of 9bits/No Parity transfer, pData buffer provided as input parameter
           should be aligned on a u16 frontier, as data copy from RDR will be
           handled by DMA from a u16 frontier. */
        if ((huart->Init.WordLength == UART_WORDLENGTH_9B) && (huart->Init.Parity == UART_PARITY_NONE))
        {
            if ((((uint32_t)pData) & 1U) != 0U)
            {
                return  HAL_ERROR;
            }
        }
        /* Process Locked */
        __HAL_LOCK(huart);

        huart->pRxBuffPtr = pData;
        huart->RxXferSize = Size;

        huart->ErrorCode = HAL_UART_ERROR_NONE;
        huart->RxState = HAL_UART_STATE_BUSY_RX;

        /* Set the UART DMA transfer complete callback */
        huart->hdmarx->XferCpltCallback = UART_DMAReceiveCplt;

        /* Set the UART DMA Half transfer complete callback */
        huart->hdmarx->XferHalfCpltCallback = UART_DMARxHalfCplt;

        /* Set the DMA error callback */
        huart->hdmarx->XferErrorCallback = UART_DMAError;

        /* Set the DMA abort callback */
        huart->hdmarx->XferAbortCallback = NULL;

        /* Enable the DMA channel */
        //  tmp = (uint32_t *)&pData;
        HAL_DMA_Start_IT(huart->hdmarx, (uint32_t)&huart->Instance->DR,(uint32_t)huart->pRxBuffPtr, Size);

        /* Clear the Overrun flag just before enabling the DMA Rx request: can be mandatory for the second transfer */
        __HAL_UART_CLEAR_OREFLAG(huart);

        /* Process Unlocked */
        __HAL_UNLOCK(huart);

        /* Enable the UART Parity Error Interrupt */
        SET_BIT(huart->Instance->CR1, USART_CR1_PEIE);

        /* Enable the UART Error Interrupt: (Frame error, noise error, overrun error) */
        SET_BIT(huart->Instance->CR3, USART_CR3_EIE);

        /* Enable the DMA transfer for the receiver request by setting the DMAR bit
        in the UART CR3 register */
        SET_BIT(huart->Instance->CR3, USART_CR3_DMAR);

        return HAL_OK;
    }
    else
    {
        return HAL_BUSY;
    }
}

/**
  * @brief Pauses the DMA Transfer.
  * @param  huart  Pointer to a UART_HandleTypeDef structure that contains
  *                the configuration information for the specified UART module.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_UART_DMAPause(UART_HandleTypeDef *huart)
{
    uint32_t dmarequest = 0x00U;

    /* Process Locked */
    __HAL_LOCK(huart);

    dmarequest = HAL_IS_BIT_SET(huart->Instance->CR3, USART_CR3_DMAT);
    if ((huart->gState == HAL_UART_STATE_BUSY_TX) && dmarequest)
    {
        /* Disable the UART DMA Tx request */
        CLEAR_BIT(huart->Instance->CR3, USART_CR3_DMAT);
    }

    dmarequest = HAL_IS_BIT_SET(huart->Instance->CR3, USART_CR3_DMAR);
    if ((huart->RxState == HAL_UART_STATE_BUSY_RX) && dmarequest)
    {
        /* Disable RXNE, PE and ERR (Frame error, noise error, overrun error) interrupts */
        CLEAR_BIT(huart->Instance->CR1, USART_CR1_PEIE);
        CLEAR_BIT(huart->Instance->CR3, USART_CR3_EIE);

        /* Disable the UART DMA Rx request */
        CLEAR_BIT(huart->Instance->CR3, USART_CR3_DMAR);
    }

    /* Process Unlocked */
    __HAL_UNLOCK(huart);

    return HAL_OK;
}

/**
  * @brief Resumes the DMA Transfer.
  * @param  huart  Pointer to a UART_HandleTypeDef structure that contains
  *                the configuration information for the specified UART module.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_UART_DMAResume(UART_HandleTypeDef *huart)
{
    /* Process Locked */
    __HAL_LOCK(huart);

