sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_uart.c
    if (huart->gState == HAL_UART_STATE_BUSY_TX)
    {
        /* Enable the UART DMA Tx request */
        SET_BIT(huart->Instance->CR3, USART_CR3_DMAT);
    }

    if (huart->RxState == HAL_UART_STATE_BUSY_RX)
    {
        /* Clear the Overrun flag before resuming the Rx transfer*/
        __HAL_UART_CLEAR_OREFLAG(huart);

        /* Reenable PE and ERR (Frame error, noise error, overrun error) interrupts */
        SET_BIT(huart->Instance->CR1, USART_CR1_PEIE);
        SET_BIT(huart->Instance->CR3, USART_CR3_EIE);

        /* Enable the UART DMA Rx request */
        SET_BIT(huart->Instance->CR3, USART_CR3_DMAR);
    }

    /* Process Unlocked */
    __HAL_UNLOCK(huart);

    return HAL_OK;
}

/**
  * @brief Stops the DMA Transfer.
  * @param  huart  Pointer to a UART_HandleTypeDef structure that contains
  *                the configuration information for the specified UART module.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_UART_DMAStop(UART_HandleTypeDef *huart)
{
    uint32_t dmarequest = 0x00U;
    /* The Lock is not implemented on this API to allow the user application
       to call the HAL UART API under callbacks HAL_UART_TxCpltCallback() / HAL_UART_RxCpltCallback():
       when calling HAL_DMA_Abort() API the DMA TX/RX Transfer complete interrupt is generated
       and the correspond call back is executed HAL_UART_TxCpltCallback() / HAL_UART_RxCpltCallback()
       */

    /* Stop UART DMA Tx request if ongoing */
    dmarequest = HAL_IS_BIT_SET(huart->Instance->CR3, USART_CR3_DMAT);
    if ((huart->gState == HAL_UART_STATE_BUSY_TX) && dmarequest)
    {
        CLEAR_BIT(huart->Instance->CR3, USART_CR3_DMAT);

        /* Abort the UART DMA Tx channel */
        if (huart->hdmatx != NULL)
        {
            HAL_DMA_Abort(huart->hdmatx);
        }
        UART_EndTxTransfer(huart);
    }

    /* Stop UART DMA Rx request if ongoing */
    dmarequest = HAL_IS_BIT_SET(huart->Instance->CR3, USART_CR3_DMAR);
    if ((huart->RxState == HAL_UART_STATE_BUSY_RX) && dmarequest)
    {
        CLEAR_BIT(huart->Instance->CR3, USART_CR3_DMAR);

        /* Abort the UART DMA Rx channel */
        if (huart->hdmarx != NULL)
        {
            HAL_DMA_Abort(huart->hdmarx);
        }
        UART_EndRxTransfer(huart);
    }

    return HAL_OK;
}

/**
  * @brief  Abort ongoing transfers (blocking mode).
  * @param  huart UART handle.
  * @note   This procedure could be used for aborting any ongoing transfer started in Interrupt or DMA mode.
  *         This procedure performs following operations :
  *           - Disable UART Interrupts (Tx and Rx)
  *           - Disable the DMA transfer in the peripheral register (if enabled)
  *           - Abort DMA transfer by calling HAL_DMA_Abort (in case of transfer in DMA mode)
  *           - Set handle State to READY
  * @note   This procedure is executed in blocking mode : when exiting function, Abort is considered as completed.
  * @retval HAL status
*/
HAL_StatusTypeDef HAL_UART_Abort(UART_HandleTypeDef *huart)
{
    /* Disable TXEIE, TCIE, RXNE, PE and ERR (Frame error, noise error, overrun error) interrupts */
    CLEAR_BIT(huart->Instance->CR1, (USART_CR1_RXNEIE | USART_CR1_PEIE | USART_CR1_TXEIE | USART_CR1_TCIE));
    CLEAR_BIT(huart->Instance->CR3, USART_CR3_EIE);

    /* Disable the UART DMA Tx request if enabled */
    if (HAL_IS_BIT_SET(huart->Instance->CR3, USART_CR3_DMAT))
    {
        CLEAR_BIT(huart->Instance->CR3, USART_CR3_DMAT);

        /* Abort the UART DMA Tx channel: use blocking DMA Abort API (no callback) */
        if (huart->hdmatx != NULL)
        {
            /* Set the UART DMA Abort callback to Null.
               No call back execution at end of DMA abort procedure */
            huart->hdmatx->XferAbortCallback = NULL;

            if (HAL_DMA_Abort(huart->hdmatx) != HAL_OK)
            {
                if (HAL_DMA_GetError(huart->hdmatx) == HAL_DMA_ERROR_TIMEOUT)
                {
                    /* Set error code to DMA */
                    huart->ErrorCode = HAL_UART_ERROR_DMA;

                    return HAL_TIMEOUT;
                }
            }
        }
    }

    /* Disable the UART DMA Rx request if enabled */
    if (HAL_IS_BIT_SET(huart->Instance->CR3, USART_CR3_DMAR))
    {
        CLEAR_BIT(huart->Instance->CR3, USART_CR3_DMAR);

        /* Abort the UART DMA Rx channel: use blocking DMA Abort API (no callback) */
        if (huart->hdmarx != NULL)
        {
            /* Set the UART DMA Abort callback to Null.
               No call back execution at end of DMA abort procedure */
            huart->hdmarx->XferAbortCallback = NULL;

            if (HAL_DMA_Abort(huart->hdmarx) != HAL_OK)
            {
                if (HAL_DMA_GetError(huart->hdmarx) == HAL_DMA_ERROR_TIMEOUT)
                {
                    /* Set error code to DMA */
                    huart->ErrorCode = HAL_UART_ERROR_DMA;

                    return HAL_TIMEOUT;
                }
            }
        }
    }

    /* Reset Tx and Rx transfer counters */
    huart->TxXferCount = 0x00U;
    huart->RxXferCount = 0x00U;

    /* Reset ErrorCode */
    huart->ErrorCode = HAL_UART_ERROR_NONE;

    /* Restore huart->RxState and huart->gState to Ready */
    huart->RxState = HAL_UART_STATE_READY;
    huart->gState = HAL_UART_STATE_READY;

    return HAL_OK;
}

/**
  * @brief  Abort ongoing Transmit transfer (blocking mode).
  * @param  huart UART handle.
  * @note   This procedure could be used for aborting any ongoing Tx transfer started in Interrupt or DMA mode.
  *         This procedure performs following operations :
  *           - Disable UART Interrupts (Tx)
  *           - Disable the DMA transfer in the peripheral register (if enabled)
  *           - Abort DMA transfer by calling HAL_DMA_Abort (in case of transfer in DMA mode)
  *           - Set handle State to READY
  * @note   This procedure is executed in blocking mode : when exiting function, Abort is considered as completed.
  * @retval HAL status
*/
HAL_StatusTypeDef HAL_UART_AbortTransmit(UART_HandleTypeDef *huart)
{
    /* Disable TXEIE and TCIE interrupts */
    CLEAR_BIT(huart->Instance->CR1, (USART_CR1_TXEIE | USART_CR1_TCIE));

    /* Disable the UART DMA Tx request if enabled */
    if (HAL_IS_BIT_SET(huart->Instance->CR3, USART_CR3_DMAT))
    {
        CLEAR_BIT(huart->Instance->CR3, USART_CR3_DMAT);

