sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_uart.c
        /* Abort the UART DMA Tx channel : use blocking DMA Abort API (no callback) */
        if (huart->hdmatx != NULL)
        {
            /* Set the UART DMA Abort callback to Null.
               No call back execution at end of DMA abort procedure */
            huart->hdmatx->XferAbortCallback = NULL;

            if (HAL_DMA_Abort(huart->hdmatx) != HAL_OK)
            {
                if (HAL_DMA_GetError(huart->hdmatx) == HAL_DMA_ERROR_TIMEOUT)
                {
                    /* Set error code to DMA */
                    huart->ErrorCode = HAL_UART_ERROR_DMA;

                    return HAL_TIMEOUT;
                }
            }
        }
    }

    /* Reset Tx transfer counter */
    huart->TxXferCount = 0x00U;

    /* Restore huart->gState to Ready */
    huart->gState = HAL_UART_STATE_READY;

    return HAL_OK;
}

/**
  * @brief  Abort ongoing Receive transfer (blocking mode).
  * @param  huart UART handle.
  * @note   This procedure could be used for aborting any ongoing Rx transfer started in Interrupt or DMA mode.
  *         This procedure performs following operations :
  *           - Disable UART Interrupts (Rx)
  *           - Disable the DMA transfer in the peripheral register (if enabled)
  *           - Abort DMA transfer by calling HAL_DMA_Abort (in case of transfer in DMA mode)
  *           - Set handle State to READY
  * @note   This procedure is executed in blocking mode : when exiting function, Abort is considered as completed.
  * @retval HAL status
*/
HAL_StatusTypeDef HAL_UART_AbortReceive(UART_HandleTypeDef *huart)
{
    /* Disable RXNE, PE and ERR (Frame error, noise error, overrun error) interrupts */
    CLEAR_BIT(huart->Instance->CR1, (USART_CR1_RXNEIE | USART_CR1_PEIE));
    CLEAR_BIT(huart->Instance->CR3, USART_CR3_EIE);

    /* Disable the UART DMA Rx request if enabled */
    if (HAL_IS_BIT_SET(huart->Instance->CR3, USART_CR3_DMAR))
    {
        CLEAR_BIT(huart->Instance->CR3, USART_CR3_DMAR);

        /* Abort the UART DMA Rx channel : use blocking DMA Abort API (no callback) */
        if (huart->hdmarx != NULL)
        {
            /* Set the UART DMA Abort callback to Null.
               No call back execution at end of DMA abort procedure */
            huart->hdmarx->XferAbortCallback = NULL;

            if (HAL_DMA_Abort(huart->hdmarx) != HAL_OK)
            {
                if (HAL_DMA_GetError(huart->hdmarx) == HAL_DMA_ERROR_TIMEOUT)
                {
                    /* Set error code to DMA */
                    huart->ErrorCode = HAL_UART_ERROR_DMA;

                    return HAL_TIMEOUT;
                }
            }
        }
    }

    /* Reset Rx transfer counter */
    huart->RxXferCount = 0x00U;

    /* Restore huart->RxState to Ready */
    huart->RxState = HAL_UART_STATE_READY;

    return HAL_OK;
}

/**
  * @brief  Abort ongoing transfers (Interrupt mode).
  * @param  huart UART handle.
  * @note   This procedure could be used for aborting any ongoing transfer started in Interrupt or DMA mode.
  *         This procedure performs following operations :
  *           - Disable UART Interrupts (Tx and Rx)
  *           - Disable the DMA transfer in the peripheral register (if enabled)
  *           - Abort DMA transfer by calling HAL_DMA_Abort_IT (in case of transfer in DMA mode)
  *           - Set handle State to READY
  *           - At abort completion, call user abort complete callback
  * @note   This procedure is executed in Interrupt mode, meaning that abort procedure could be
  *         considered as completed only when user abort complete callback is executed (not when exiting function).
  * @retval HAL status
*/
HAL_StatusTypeDef HAL_UART_Abort_IT(UART_HandleTypeDef *huart)
{
    uint32_t AbortCplt = 0x01U;

    /* Disable TXEIE, TCIE, RXNE, PE and ERR (Frame error, noise error, overrun error) interrupts */
    CLEAR_BIT(huart->Instance->CR1, (USART_CR1_RXNEIE | USART_CR1_PEIE | USART_CR1_TXEIE | USART_CR1_TCIE));
    CLEAR_BIT(huart->Instance->CR3, USART_CR3_EIE);

    /* If DMA Tx and/or DMA Rx Handles are associated to UART Handle, DMA Abort complete callbacks should be initialised
       before any call to DMA Abort functions */
    /* DMA Tx Handle is valid */
    if (huart->hdmatx != NULL)
    {
        /* Set DMA Abort Complete callback if UART DMA Tx request if enabled.
           Otherwise, set it to NULL */
        if (HAL_IS_BIT_SET(huart->Instance->CR3, USART_CR3_DMAT))
        {
            huart->hdmatx->XferAbortCallback = UART_DMATxAbortCallback;
        }
        else
        {
            huart->hdmatx->XferAbortCallback = NULL;
        }
    }
    /* DMA Rx Handle is valid */
    if (huart->hdmarx != NULL)
    {
        /* Set DMA Abort Complete callback if UART DMA Rx request if enabled.
           Otherwise, set it to NULL */
        if (HAL_IS_BIT_SET(huart->Instance->CR3, USART_CR3_DMAR))
        {
            huart->hdmarx->XferAbortCallback = UART_DMARxAbortCallback;
        }
        else
        {
            huart->hdmarx->XferAbortCallback = NULL;
        }
    }

    /* Disable the UART DMA Tx request if enabled */
    if (HAL_IS_BIT_SET(huart->Instance->CR3, USART_CR3_DMAT))
    {
        /* Disable DMA Tx at UART level */
        CLEAR_BIT(huart->Instance->CR3, USART_CR3_DMAT);

        /* Abort the UART DMA Tx channel : use non blocking DMA Abort API (callback) */
        if (huart->hdmatx != NULL)
        {
            /* UART Tx DMA Abort callback has already been initialised :
               will lead to call HAL_UART_AbortCpltCallback() at end of DMA abort procedure */

            /* Abort DMA TX */
            if (HAL_DMA_Abort_IT(huart->hdmatx) != HAL_OK)
            {
                huart->hdmatx->XferAbortCallback = NULL;
            }
            else
            {
                AbortCplt = 0x00U;
            }
        }
    }

    /* Disable the UART DMA Rx request if enabled */
    if (HAL_IS_BIT_SET(huart->Instance->CR3, USART_CR3_DMAR))
    {
        CLEAR_BIT(huart->Instance->CR3, USART_CR3_DMAR);

        /* Abort the UART DMA Rx channel : use non blocking DMA Abort API (callback) */
        if (huart->hdmarx != NULL)
        {
            /* UART Rx DMA Abort callback has already been initialised :
               will lead to call HAL_UART_AbortCpltCallback() at end of DMA abort procedure */

