sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_uart.c
            /* Abort DMA RX */
            if (HAL_DMA_Abort_IT(huart->hdmarx) != HAL_OK)
            {
                huart->hdmarx->XferAbortCallback = NULL;
                AbortCplt = 0x01U;
            }
            else
            {
                AbortCplt = 0x00U;
            }
        }
    }

    /* if no DMA abort complete callback execution is required => call user Abort Complete callback */
    if (AbortCplt == 0x01U)
    {
        /* Reset Tx and Rx transfer counters */
        huart->TxXferCount = 0x00U;
        huart->RxXferCount = 0x00U;

        /* Reset ErrorCode */
        huart->ErrorCode = HAL_UART_ERROR_NONE;

        /* Restore huart->gState and huart->RxState to Ready */
        huart->gState  = HAL_UART_STATE_READY;
        huart->RxState = HAL_UART_STATE_READY;

        /* As no DMA to be aborted, call directly user Abort complete callback */
#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
        /* Call registered Abort complete callback */
        huart->AbortCpltCallback(huart);
#else
        /* Call legacy weak Abort complete callback */
        HAL_UART_AbortCpltCallback(huart);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
    }

    return HAL_OK;
}

/**
  * @brief  Abort ongoing Transmit transfer (Interrupt mode).
  * @param  huart UART handle.
  * @note   This procedure could be used for aborting any ongoing Tx transfer started in Interrupt or DMA mode.
  *         This procedure performs following operations :
  *           - Disable UART Interrupts (Tx)
  *           - Disable the DMA transfer in the peripheral register (if enabled)
  *           - Abort DMA transfer by calling HAL_DMA_Abort_IT (in case of transfer in DMA mode)
  *           - Set handle State to READY
  *           - At abort completion, call user abort complete callback
  * @note   This procedure is executed in Interrupt mode, meaning that abort procedure could be
  *         considered as completed only when user abort complete callback is executed (not when exiting function).
  * @retval HAL status
*/
HAL_StatusTypeDef HAL_UART_AbortTransmit_IT(UART_HandleTypeDef *huart)
{
    /* Disable TXEIE and TCIE interrupts */
    CLEAR_BIT(huart->Instance->CR1, (USART_CR1_TXEIE | USART_CR1_TCIE));

    /* Disable the UART DMA Tx request if enabled */
    if (HAL_IS_BIT_SET(huart->Instance->CR3, USART_CR3_DMAT))
    {
        CLEAR_BIT(huart->Instance->CR3, USART_CR3_DMAT);

        /* Abort the UART DMA Tx channel : use blocking DMA Abort API (no callback) */
        if (huart->hdmatx != NULL)
        {
            /* Set the UART DMA Abort callback :
               will lead to call HAL_UART_AbortCpltCallback() at end of DMA abort procedure */
            huart->hdmatx->XferAbortCallback = UART_DMATxOnlyAbortCallback;

            /* Abort DMA TX */
            if (HAL_DMA_Abort_IT(huart->hdmatx) != HAL_OK)
            {
                /* Call Directly huart->hdmatx->XferAbortCallback function in case of error */
                huart->hdmatx->XferAbortCallback(huart->hdmatx);
            }
        }
        else
        {
            /* Reset Tx transfer counter */
            huart->TxXferCount = 0x00U;

            /* Restore huart->gState to Ready */
            huart->gState = HAL_UART_STATE_READY;

            /* As no DMA to be aborted, call directly user Abort complete callback */
#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
            /* Call registered Abort Transmit Complete Callback */
            huart->AbortTransmitCpltCallback(huart);
#else
            /* Call legacy weak Abort Transmit Complete Callback */
            HAL_UART_AbortTransmitCpltCallback(huart);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
        }
    }
    else
    {
        /* Reset Tx transfer counter */
        huart->TxXferCount = 0x00U;

        /* Restore huart->gState to Ready */
        huart->gState = HAL_UART_STATE_READY;

        /* As no DMA to be aborted, call directly user Abort complete callback */
#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
        /* Call registered Abort Transmit Complete Callback */
        huart->AbortTransmitCpltCallback(huart);
#else
        /* Call legacy weak Abort Transmit Complete Callback */
        HAL_UART_AbortTransmitCpltCallback(huart);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
    }

    return HAL_OK;
}

/**
  * @brief  Abort ongoing Receive transfer (Interrupt mode).
  * @param  huart UART handle.
  * @note   This procedure could be used for aborting any ongoing Rx transfer started in Interrupt or DMA mode.
  *         This procedure performs following operations :
  *           - Disable UART Interrupts (Rx)
  *           - Disable the DMA transfer in the peripheral register (if enabled)
  *           - Abort DMA transfer by calling HAL_DMA_Abort_IT (in case of transfer in DMA mode)
  *           - Set handle State to READY
  *           - At abort completion, call user abort complete callback
  * @note   This procedure is executed in Interrupt mode, meaning that abort procedure could be
  *         considered as completed only when user abort complete callback is executed (not when exiting function).
  * @retval HAL status
*/
HAL_StatusTypeDef HAL_UART_AbortReceive_IT(UART_HandleTypeDef *huart)
{
    /* Disable RXNE, PE and ERR (Frame error, noise error, overrun error) interrupts */
    CLEAR_BIT(huart->Instance->CR1, (USART_CR1_RXNEIE | USART_CR1_PEIE));
    CLEAR_BIT(huart->Instance->CR3, USART_CR3_EIE);

    /* Disable the UART DMA Rx request if enabled */
    if (HAL_IS_BIT_SET(huart->Instance->CR3, USART_CR3_DMAR))
    {
        CLEAR_BIT(huart->Instance->CR3, USART_CR3_DMAR);

        /* Abort the UART DMA Rx channel : use blocking DMA Abort API (no callback) */
        if (huart->hdmarx != NULL)
        {
            /* Set the UART DMA Abort callback :
               will lead to call HAL_UART_AbortCpltCallback() at end of DMA abort procedure */
            huart->hdmarx->XferAbortCallback = UART_DMARxOnlyAbortCallback;

            /* Abort DMA RX */
            if (HAL_DMA_Abort_IT(huart->hdmarx) != HAL_OK)
            {
                /* Call Directly huart->hdmarx->XferAbortCallback function in case of error */
                huart->hdmarx->XferAbortCallback(huart->hdmarx);
            }
        }
        else
        {
            /* Reset Rx transfer counter */
            huart->RxXferCount = 0x00U;

            /* Restore huart->RxState to Ready */
            huart->RxState = HAL_UART_STATE_READY;

            /* As no DMA to be aborted, call directly user Abort complete callback */
#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
            /* Call registered Abort Receive Complete Callback */
            huart->AbortReceiveCpltCallback(huart);
#else
            /* Call legacy weak Abort Receive Complete Callback */
            HAL_UART_AbortReceiveCpltCallback(huart);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
        }
    }
    else
    {
        /* Reset Rx transfer counter */
        huart->RxXferCount = 0x00U;

        /* Restore huart->RxState to Ready */
        huart->RxState = HAL_UART_STATE_READY;

        /* As no DMA to be aborted, call directly user Abort complete callback */
#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
        /* Call registered Abort Receive Complete Callback */
        huart->AbortReceiveCpltCallback(huart);
#else
        /* Call legacy weak Abort Receive Complete Callback */
        HAL_UART_AbortReceiveCpltCallback(huart);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
    }

    return HAL_OK;
}

/**
  * @brief  This function handles UART interrupt request.
  * @param  huart  Pointer to a UART_HandleTypeDef structure that contains
  *                the configuration information for the specified UART module.
  * @retval None
  */
void HAL_UART_IRQHandler(UART_HandleTypeDef *huart)
{
    uint32_t isrflags   = READ_REG(huart->Instance->SR);
    uint32_t cr1its     = READ_REG(huart->Instance->CR1);
    uint32_t cr3its     = READ_REG(huart->Instance->CR3);
    uint32_t errorflags = 0x00U;
    uint32_t dmarequest = 0x00U;

    /* If no error occurs */
    errorflags = (isrflags & (uint32_t)(USART_SR_PE | USART_SR_FE | USART_SR_ORE | USART_SR_NE));
    if (errorflags == RESET)
    {
        /* UART in mode Receiver -------------------------------------------------*/
        if (((isrflags & USART_SR_RXNE) != RESET) && ((cr1its & USART_CR1_RXNEIE) != RESET))
        {
            UART_Receive_IT(huart);
            return;
        }
    }

    /* If some errors occur */
    if ((errorflags != RESET) && (((cr3its & USART_CR3_EIE) != RESET) || ((cr1its & (USART_CR1_RXNEIE | USART_CR1_PEIE)) != RESET)))
    {
        /* UART parity error interrupt occurred ----------------------------------*/
        if (((isrflags & USART_SR_PE) != RESET) && ((cr1its & USART_CR1_PEIE) != RESET))
        {
            huart->ErrorCode |= HAL_UART_ERROR_PE;
        }

