sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_uart.c
    /*-------------------------- USART CR3 Configuration -----------------------*/
    /* Configure the UART HFC: Set CTSE and RTSE bits according to huart->Init.HwFlowCtl value */
    MODIFY_REG(huart->Instance->CR3, (USART_CR3_RTSE | USART_CR3_CTSE), huart->Init.HwFlowCtl);

#if defined(USART_CR3_OVER8)
    /* Check the Over Sampling */
    if(huart->Init.OverSampling == UART_OVERSAMPLING_8)
    {
        /*-------------------------- USART BRR Configuration ---------------------*/
//    if(huart->Instance == USART1)
//    {
//      pclk = HAL_RCC_GetPCLK2Freq();
//      huart->Instance->BRR = UART_BRR_SAMPLING8(pclk, huart->Init.BaudRate);
//    }
//    else
        {
            pclk = HAL_RCC_GetPCLK1Freq();
            huart->Instance->BRR = UART_BRR_SAMPLING8(pclk, huart->Init.BaudRate);
        }
    }
    else
    {
        /*-------------------------- USART BRR Configuration ---------------------*/
//    if(huart->Instance == USART1)
//    {
//      pclk = HAL_RCC_GetPCLK2Freq();
//      huart->Instance->BRR = UART_BRR_SAMPLING16(pclk, huart->Init.BaudRate);
//    }
//    else
        {
            pclk = HAL_RCC_GetPCLK1Freq();
            huart->Instance->BRR = UART_BRR_SAMPLING16(pclk, huart->Init.BaudRate);
        }
    }
#else
    /*-------------------------- USART BRR Configuration ---------------------*/

    pclk = HAL_RCC_GetPCLK1Freq();
    huart->Instance->BRR = UART_BRR_SAMPLING16(pclk, huart->Init.BaudRate);

#endif /* USART_CR3_OVER8 */
}
/**
  * @brief Configure the UART peripheral advanced features.
  * @param huart UART handle.
  * @retval None
  */
void UART_AdvFeatureConfig(UART_HandleTypeDef *huart)
{
    /* Check whether the set of advanced features to configure is properly set */
    assert_param(IS_UART_ADVFEATURE_INIT(huart->AdvancedInit.AdvFeatureInit));


    /* if required, configure auto Baud rate detection scheme */
    if (HAL_IS_BIT_SET(huart->AdvancedInit.AdvFeatureInit, UART_ADVFEATURE_AUTOBAUDRATE_INIT))
    {
        assert_param(IS_USART_AUTOBAUDRATE_DETECTION_INSTANCE(huart->Instance));
        assert_param(IS_UART_ADVFEATURE_AUTOBAUDRATE(huart->AdvancedInit.AutoBaudRateEnable));
        MODIFY_REG(huart->Instance->CR3, USART_CR3_ABREN, huart->AdvancedInit.AutoBaudRateEnable);
        /* set auto Baudrate detection parameters if detection is enabled */
        if (huart->AdvancedInit.AutoBaudRateEnable == UART_ADVFEATURE_AUTOBAUDRATE_ENABLE)
        {
            assert_param(IS_UART_ADVFEATURE_AUTOBAUDRATEMODE(huart->AdvancedInit.AutoBaudRateMode));
            MODIFY_REG(huart->Instance->CR3, USART_CR3_ABRMODE, huart->AdvancedInit.AutoBaudRateMode);
        }
    }

    /* if required, configure MSB first on communication line */
//  if (HAL_IS_BIT_SET(huart->AdvancedInit.AdvFeatureInit, UART_ADVFEATURE_MSBFIRST_INIT))
//  {
//    assert_param(IS_UART_ADVFEATURE_MSBFIRST(huart->AdvancedInit.MSBFirst));
//    MODIFY_REG(huart->Instance->CR2, USART_CR2_MSBFIRST, huart->AdvancedInit.MSBFirst);
//  }
}
/**
  * @}
  */

#endif /* HAL_UART_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT Puya *****END OF FILE****/
